data/WLM Data/Full Login/updateContactInfo.xml

https://omega.contacts.msn.com/abservice/abservice.asmx

POST /abservice/abservice.asmx HTTP/1.1
Accept: text/*
SOAPAction: http://www.msn.com/webservices/AddressBook/ABContactUpdate
Content-Type: text/xml; charset=utf-8
User-Agent: MSN Explorer/9.0 (MSN 8.0; TmstmpExt)
Host: omega.contacts.msn.com
Content-Length: 5213
Connection: Keep-Alive
Cache-Control: no-cache

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Header>
    <ABApplicationHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ApplicationId>996CDE1E-AA53-4477-B943-2BE802EA6166</ApplicationId>
      <IsMigration>false</IsMigration>
      <PartnerScenario>ContactSave</PartnerScenario>
      <CacheKey>12r3:oor7v1zvsCWKJuVkuHVD/V55/HcIjzfc4Z5yujljk7X2iRmabuQZYoRj05nUyeUKxPMHJQe1OXEU7U/edeCmIcjQJ37EZJ/JyZkPbybDES3l68dsD4hWc5jGU6Xi9yd2dbPusrpDvDG0FOD3LYKUlYdQf4xs3Txlo4btPDbIUr4=</CacheKey>
    </ABApplicationHeader>
    <ABAuthHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <ManagedGroupRequest>false</ManagedGroupRequest>
      <TicketToken>t=EwDIAcBdAAAU7/9PdvvYJ23zPPtor/FYp6zOOb+AACew9ABFVGaeqeAlfNvbF6YT/OdKwLUyxGarq/yhjJPpF4tA276y46WLReFrChN6/CEU31akhJ1tAuM2Fni9XEaMGVVA7jlW1dmDVMa3bMikxS+nsUoY4vYCsSgnbMxDIMeuLmDsm/zV5frFKVU+ysItr+5XDBAv6vJDx0eysW9CA2YAAAhiV61UfqJ2SBgBQ+RoEReNgU+pvGoPtjraJlXQMfhsELqueLs598z1V2PEZUUB88Vtkbb6dIRgM4c16IlrNm8RQkd8iz5i8EmCrn/7FCEscbp84v2X+6a4sqd29f7PWd54ZztxHhAJPIuJ6ZtciEp0U3lu20jW9JCq4LH6ydxGD1Hyo0FHk8kLWEjvDylQCmcLIIHDFHOQOsYa7LtsSytMen5pG3EpQCxDjmyBtjyFz7PIHm3ZOApetTjCLAVSb5LrNjadGlyWzJdwPQP7uR6tg2GoqrYzbgMkMwp0gudoCSAagAyM6QhmGy3Agwfd2yKJW/K7O/CRbqF0GaVunIS4laI1aT/M82NP2atntRL8m6+3kqupjMyTvb2oOG12sf7tSTAB&amp;p=</TicketToken>
    </ABAuthHeader>
  </soap:Header>
  <soap:Body>
    <ABContactUpdate xmlns="http://www.msn.com/webservices/AddressBook">
      <abId>00000000-0000-0000-0000-000000000000</abId>
      <contacts>
        <Contact xmlns="http://www.msn.com/webservices/AddressBook">
          <contactId>3b0977f1-b62e-4dd3-80e4-8a216118c70a</contactId>
          <contactInfo>
            <contactType>LivePending</contactType>
            <firstName>firstname</firstName>
            <lastName>lastname</lastName>
            <comment>Notes 111</comment>
            <Anniversary>2000/02/02</Anniversary>
            <birthdate>1983-01-24T00:00:00Z</birthdate>
            <annotations>
              <Annotation>
                <Name>AB.JobTitle</Name>
                <Value>title</Value>
              </Annotation>
              <Annotation>
                <Name>AB.NickName</Name>
                <Value>spleak.nickname</Value>
              </Annotation>
              <Annotation>
                <Name>AB.Spouse</Name>
                <Value>spouse</Value>
              </Annotation>
            </annotations>
            <emails>
              <ContactEmail>
                <contactEmailType>ContactEmailBusiness</contactEmailType>
                <email>work_email@abc.com</email>
                <propertiesChanged>Email</propertiesChanged>
              </ContactEmail>
              <ContactEmail>
                <contactEmailType>ContactEmailMessenger</contactEmailType>
                <email>other_IM_addrss@abc.com</email>
                <propertiesChanged>Email</propertiesChanged>
              </ContactEmail>
              <ContactEmail>
                <contactEmailType>ContactEmailOther</contactEmailType>
                <email>other_email@abc.com</email>
                <propertiesChanged>Email</propertiesChanged>
              </ContactEmail>
              <ContactEmail>
                <contactEmailType>ContactEmailPersonal</contactEmailType>
                <email>contact_p_email@abc.com</email>
                <propertiesChanged>Email</propertiesChanged>
              </ContactEmail>
            </emails>
            <phones>
              <ContactPhone>
                <contactPhoneType>ContactPhoneBusiness</contactPhoneType>
                <number>work_phone</number>
                <propertiesChanged>Number</propertiesChanged>
              </ContactPhone>
              <ContactPhone>
                <contactPhoneType>ContactPhoneFax</contactPhoneType>
                <number>work_home_fax</number>
                <propertiesChanged>Number</propertiesChanged>
              </ContactPhone>
              <ContactPhone>
                <contactPhoneType>ContactPhoneMobile</contactPhoneType>
                <number>+86123456</number>
                <isMessengerEnabled>true</isMessengerEnabled>
                <propertiesChanged>Number IsMessengerEnabled</propertiesChanged>
              </ContactPhone>
              <ContactPhone>
                <contactPhoneType>ContactPhoneOther</contactPhoneType>
                <number>other_phone-contact</number>
                <propertiesChanged>Number</propertiesChanged>
              </ContactPhone>
              <ContactPhone>
                <contactPhoneType>ContactPhonePager</contactPhoneType>
                <number>work_mobile</number>
                <propertiesChanged>Number</propertiesChanged>
              </ContactPhone>
              <ContactPhone>
                <contactPhoneType>ContactPhonePersonal</contactPhoneType>
                <number>personal_home_phone</number>
                <propertiesChanged>Number</propertiesChanged>
              </ContactPhone>
            </phones>
            <locations>
              <ContactLocation>
                <contactLocationType>ContactLocationBusiness</contactLocationType>
                <name>company</name>
                <street>work_addr</street>
                <city>work_city</city>
                <state>work_state</state>
                <country>work_country</country>
                <postalCode>work_zip</postalCode>
                <Changes>Name Street City State Country PostalCode</Changes>
              </ContactLocation>
              <ContactLocation>
                <contactLocationType>ContactLocationPersonal</contactLocationType>
                <street>personal_street_add</street>
                <city>personal_city</city>
                <state>state</state>
                <country>country</country>
                <postalCode>personal-zip</postalCode>
                <Changes>Street City State Country PostalCode</Changes>
              </ContactLocation>
            </locations>
            <webSites>
              <ContactWebSite>
                <contactWebSiteType>ContactWebSiteBusiness</contactWebSiteType>
                <webURL>http://work_website.com</webURL>
              </ContactWebSite>
              <ContactWebSite>
                <contactWebSiteType>ContactWebSitePersonal</contactWebSiteType>
                <webURL>http://website.com</webURL>
              </ContactWebSite>
            </webSites>
          </contactInfo>
          <propertiesChanged>ContactType ContactFirstName ContactLastName Comment Anniversary ContactBirthDate ContactEmail ContactLocation ContactPhone ContactWebSite Annotation</propertiesChanged>
        </Contact>
      </contacts>
      <options>
        <EnableAllowListManagement>true</EnableAllowListManagement>
      </options>
    </ABContactUpdate>
  </soap:Body>
</soap:Envelope>
=============================
OK
HTTP/1.1 200 OK
Date: Thu, 07 Jun 2007 17:59:56 GMT
Server: Microsoft-IIS/6.0
P3P:CP="BUS CUR CONo FIN IVDo ONL OUR PHY SAMo TELo"
X-Powered-By: ASP.NET
X-MSNSERVER: BAYABCHWBB191
X-AspNet-Version: 2.0.50727
Cache-Control: private, max-age=0
Content-Type: text/xml; charset=utf-8
Content-Length: 570

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Header>
    <ServiceHeader xmlns="http://www.msn.com/webservices/AddressBook">
      <Version>
        12.03.1527.0001
      </Version>
      <CacheKeyChanged>false</CacheKeyChanged>
      <PreferredHostName>omega.contacts.msn.com</PreferredHostName>
    </ServiceHeader>
  </soap:Header>
  <soap:Body>
    <ABContactUpdateResponse xmlns="http://www.msn.com/webservices/AddressBook" />
  </soap:Body>
</soap:Envelope>
=======================
wrong format
HTTP/1.1 500 Internal Server Error
Date: Thu, 07 Jun 2007 17:56:06 GMT
Server: Microsoft-IIS/6.0
P3P:CP="BUS CUR CONo FIN IVDo ONL OUR PHY SAMo TELo"
X-Powered-By: ASP.NET
X-MSNSERVER: BAYABCHWBB183
X-AspNet-Version: 2.0.50727
Cache-Control: private
Content-Type: text/xml; charset=utf-8
Content-Length: 858

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
  <soap:Body>
    <soap:Fault>
      <faultcode>soap:Client</faultcode>
      <faultstring>Malformed email Argument Email missing '@' character</faultstring>
      <faultactor>http://www.msn.com/webservices/AddressBook/ABContactUpdate</faultactor>
      <detail>
        <errorcode xmlns="http://www.msn.com/webservices/AddressBook">BadEmailArgument</errorcode>
        <errorstring xmlns="http://www.msn.com/webservices/AddressBook">Malformed email Argument Email missing '@' character</errorstring>
        <additionalDetails>
          <originalExceptionErrorMessage>Malformed email Argument Email missing '@' character</originalExceptionErrorMessage>
        </additionalDetails>
      </detail>
    </soap:Fault>
  </soap:Body>
</soap:Envelope>